<#
#̷𝓍   𝓐𝓡𝓢 𝓢𝓒𝓡𝓘𝓟𝓣𝓤𝓜
#̷𝓍   🇵​​​​​🇴​​​​​🇼​​​​​🇪​​​​​🇷​​​​​🇸​​​​​🇭​​​​​🇪​​​​​🇱​​​​​🇱​​​​​ 🇸​​​​​🇨​​​​​🇷​​​​​🇮​​​​​🇵​​​​​🇹​​​​​ 🇧​​​​​🇾​​​​​ 🇬​​​​​🇺​​​​​🇮​​​​​🇱​​​​​🇱​​​​​🇦​​​​​🇺​​​​​🇲​​​​​🇪​​​​​🇵​​​​​🇱​​​​​🇦​​​​​🇳​​​​​🇹​​​​​🇪​​​​​.🇶​​​​​🇨​​​​​@🇬​​​​​🇲​​​​​🇦​​​​​🇮​​​​​🇱​​​​​.🇨​​​​​🇴​​​​​🇲​​​​​
#>


Function ShouldCreateFolder($Folder){
    $yeah = New-Object System.Management.Automation.Host.ChoiceDescription "&Yes","Description."
    $nah = New-Object System.Management.Automation.Host.ChoiceDescription "&No exit","Description."
    $options = [System.Management.Automation.Host.ChoiceDescription[]]($yeah, $nah)
    $mess = "Create Destination Folder ($Folder) ?"
    $rslt = $host.ui.PromptForChoice('', $mess, $options, 1)
    
    return ($rslt -eq 0)
}
